Revit 2027 API
SpecTypeId.DuctSize Property
 Duct Size, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DuctSize { get; }
Public Shared ReadOnly Property DuctSize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DuctSize {
	ForgeTypeId^ get ();
}
static member DuctSize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace